#include "LensGhostDemo.h"

//-----------------------------------------------------------------------------
// サブシステム初期化直後
//-----------------------------------------------------------------------------
void LensGhostDemo::OnStart()
{
	//カメラ
	m_spCamera = std::make_shared<FPSCamera>();
	if (m_spCamera)
	{
		m_spCamera->m_name = "Camera Main";
		m_spCamera->m_priority = 10.0f;
		m_spCamera->SetCameraMatrix(matrix4x4::CreateTranslation(float3(0, 0, -1)));
		m_spCamera->SetLocalPos(float3(0, 0, 0));
		m_pCameraManager->AddCameraList(m_spCamera);
	}
}

//-----------------------------------------------------------------------------
// サブシステム終了直前
//-----------------------------------------------------------------------------
void LensGhostDemo::OnEnd()
{
}

//-----------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------
void LensGhostDemo::OnUpdate()
{
	m_spCamera->SetCameraMatrix(matrix4x4::CreateTranslation(0, 0, -10));
}

//-----------------------------------------------------------------------------
// 3D描画
//-----------------------------------------------------------------------------
void LensGhostDemo::OnDraw3D()
{
}

//-----------------------------------------------------------------------------
// 2D描画
//-----------------------------------------------------------------------------
void LensGhostDemo::OnDraw2D(SpriteShader& spriteShader)
{
}

//-----------------------------------------------------------------------------
// 描画後更新
//-----------------------------------------------------------------------------
void LensGhostDemo::OnLateUpdate()
{
}
